# IsProjected Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
AreaLoad..::..IsProjected Property
AreaLoad Class See Also
---
Indicates if the load is projected.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016
# Syntax
C#
---
```text
public bool IsProjected { get; set; }
```

Visual Basic
---
```text
Public Property IsProjected As Boolean
	Get
	Set
```

Visual C++
---
```text
public:
property bool IsProjected {
	bool get ();
	void set (bool value);
}
```

# Remarks
Returns true if the area load is projected, false otherwise. This parameter will take effect only if AreaLoad.OrientTo property is set to LoadOrientTo.Project.
# See Also
AreaLoad Class
Autodesk.Revit.DB.Structure Namespace